ISABELLE WAKISA B30311 S24B38/019

In [1]:
import pandas as pd

In [3]:
pd.read_excel("Student_performance.xlsx")

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

In [4]:
data =pd.read_excel("Student_performance.xlsx")

In [5]:
data.info

<bound method DataFrame.info of     Access_no  gender  age                  course  DSC3108  DSC3114  MTH3108  \
0         123  female   21        Computer_Science     89.0     88.0       72
1         415    male   22        Computer_Science     91.0     98.0       88
2         321    male   21            Data_Science     73.0     70.0       38
3         124  female   21  Information_Technology     30.0     40.0       60
4         314  female   22        Computer_Science     70.0     75.0       78
5         891    male   21  Information_Technology     25.0     70.0       69
6         729  female   22            Data_Science     65.0     80.0       38
7         892  female   21            Data_Science     90.0     95.0       92
8         545    male   22                     NaN     54.0     69.0       78
9         718  female   21  Information_Technology      NaN     78.0       79
10        390    male   22        Computer_Science     45.0      NaN       79

    SYE3104
0        65
1        89
2        41
3        31
4        60
5        19
6        43
7        93
8        77
9        88
10       85  >

Checking for missing information

In [7]:
data.isna().sum()

Access_no    0
gender       0
age          0
course       1
DSC3108      1
DSC3114      1
MTH3108      0
SYE3104      0
dtype: int64

In [26]:
new_data =data.fillna(method ='ffill')
new_data

C:\Users\isabe\AppData\Local\Temp\ipykernel_25756\3868509640.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data =data.fillna(method ='ffill')

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,Data_Science,54.0,69.0,78,77
9,718,female,21,Information_Technology,54.0,78.0,79,88
10,390,male,22,Computer_Science,45.0,78.0,79,85

In [27]:
total_students = len(new_data)  #First we found the total number of students
total_students

11

PROBABILITY OF STUDENTS STUDYING IT

In [28]:
information_technology = new_data[new_data['course'] == "Information_Technology"]['course'].count()
information_technology

np.int64(3)

In [29]:
probability = information_technology/total_students
probability

np.float64(0.2727272727272727)

FEMALE STUDENTS STUDYING COMPUTER SCIENCE

In [30]:
female_students = new_data[(new_data['gender'] == "female") & (new_data['course'] == 'Computer_Science')]['course'].count()
female_students

np.int64(2)

In [31]:
probability = female_students/total_students
probability

np.float64(0.18181818181818182)

MALE STUDENTS STUDYING DATA SCIENCE

In [32]:
male_students = new_data[(new_data['gender'] == "male") & (new_data['course'] == 'Data_Science')]['course'].count()
male_students

np.int64(2)

In [33]:
probability = male_students/total_students
probability

np.float64(0.18181818181818182)